app/views/sold_dishes/new.html.erb

          <td><%= @commission%></td>
          <td><%= User.find_by(id: Recipe.find_by(id: dish.recipe_id).user_id).username %></td>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 21]]