app/views/recipes/index.html.erb

      <li><%= recipe.name %><br>
      <span class="forks"><%= recipe.ratings.length  %></span> forks || <%= link_to recipe.user.username, user_path(recipe.user) %>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT "ratings".* FROM "ratings"  WHERE "ratings"."recipe_id" = ?  [["recipe_id", 7]]