app/views/recipes/show.html.erb

<h2>Created by <%= @recipe.user.username %></h2>
<h2>Rating: <%= Rating.find_by(recipe_id: @recipe.id).rating/ @recipe.ratings.count %></h2>
---
SELECT "ratings".* FROM "ratings"  WHERE "ratings"."recipe_id" = ?  [["recipe_id", 1]]
SELECT COUNT(*) FROM "ratings"  WHERE "ratings"."recipe_id" = ?  [["recipe_id", 6]]

  <% end %>
  <% if !@recipe.ratings.find_by(user_id: current_user.id) %>
---
SELECT  "ratings".* FROM "ratings"  WHERE "ratings"."recipe_id" = ? AND "ratings"."user_id" = 21 LIMIT 1  [["recipe_id", 1]]