app/views/users/index.html.erb

			    	<% comission = dish.number_sold*dish.price_sold*0.1 %>
					<td><%= Recipe.find_by(id: dish.recipe_id).name %></td>
---
SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = 2 LIMIT 1

					<td><%= comission%></td>
					<td><%= User.find_by(id: Recipe.find_by(id: dish.recipe_id).user_id).username %></td>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 16 LIMIT 1