app/views/users/show.html.erb

SELECT "recipes".* FROM "recipes"  WHERE "recipes"."user_id" = ?  [["user_id", 1]]
SELECT  "ratings".* FROM "ratings"  WHERE "ratings"."recipe_id" = 10 LIMIT 1
SELECT COUNT(*) FROM "ratings"  WHERE "ratings"."recipe_id" = ?  [["recipe_id", 10]]
---
	<ul >
	    <% @user.recipes.each do |recipe| %>
	      <li><%= recipe.name %><br>
	      <span class="forks"><%= Rating.find_by(recipe_id: recipe.id).rating/ recipe.ratings.count %></span> forks <br>