app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("created_at", "description", "updated_at") VALUES (?, ?, ?)  [["created_at", "2016-08-25 17:32:37.687099"], ["description", "testtesttest"], ["updated_at", "2016-08-25 17:32:37.687099"]]
---
  def create
    @recipe = Recipe.new(recipe_params)
    if @recipe.save