app/controllers/sold_dishes_controller.rb

  def destroy
    SoldDish.delete_all
---
DELETE FROM "sold_dishes"