app/controllers/users_controller.rb

  def index
    @solddish= SoldDish.all
---
SELECT "sold_dishes".* FROM "sold_dishes"

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)